meeting/agenda/2024/03-19.org
:PROPERTIES:
:ID:       66536ABC-1131-4AC8-BD7F-F956A0AD6BF8
:END:
#+title: QT4 CG Meeting 070 Agenda 2024-03-19
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT, 09:00PDT).

Reminder: The QT4CG meeting is scheduled on UK/European civil time. The United
States has switched to daylight saving time, so the meeting will be one hour
later there until the UK/Europe also switches (on 31 March 2024).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/03-12.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 19 March. The following meeting is
scheduled for 26 March.

Any regrets for 26 March 2024?

** Review of open action items [2/6]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [X] QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”
  + Proposed: next Tuesday at 15:00GMT (16:00CET, 11:00EDT) 
+ [ ] QT4CG-063-04: NW to try to add test review to the editorial meeting.
+ [ ] QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record
+ [ ] QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.
+ [X] QT4CG-069-01: MK to list the remaining issues that need discussion.
+ [-] QT4CG-069-02: NW to coordinate with MK to use the introspection features on the test suite.
  + In progress…

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-956][#956]]: 850-partial Editorial improvements to parse-html()
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1090][#1090]]: 1089 Add rounding rules for casting string to duration etc
+ PR [[https://qt4cg.org/dashboard/#pr-1083][#1083]]: 1079 Change book used in example
+ PR [[https://qt4cg.org/dashboard/#pr-1081][#1081]]: 1050 Fix ItemType grammar ambiguity
+ PR [[https://qt4cg.org/dashboard/#pr-1080][#1080]]: 1036 Rephrase the rules for number-parser with liberal JSON
+ PR [[https://qt4cg.org/dashboard/#pr-1073][#1073]]: XQFO (editorial)
+ PR [[https://qt4cg.org/dashboard/#pr-1072][#1072]]: 883 Return type of load-xquery-module

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/757][#757]]: Function families
+ Issue [[https://github.com/qt4cg/qtspecs/issues/463][#463]]: fn:parts() - extract the parts of a (not-really) atomic value
+ Issue [[https://github.com/qt4cg/qtspecs/issues/448][#448]]: Support extended dateTime formats of ISO-8601:2019?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/283][#283]]: Enumeration types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/218][#218]]: Function library for maps with composite keys: and thoughts on encapsulation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/119][#119]]: Allow a map's key value to be any sequence
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: JSON Parsing & Serialization: Numbers

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-1083][#1083]]: 1079 Change book used in example
+ PR [[https://qt4cg.org/dashboard/#pr-1015][#1015]]: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes
+ PR [[https://qt4cg.org/dashboard/#pr-921][#921]]: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch
+ PR [[https://qt4cg.org/dashboard/#pr-871][#871]]: Action qt4 cg 027 01 next match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1093][#1093]]: 1091 Add fn:collation function
+ PR [[https://qt4cg.org/dashboard/#pr-1092][#1092]]: 1039 Add notes referring to fn:collation-key
+ PR [[https://qt4cg.org/dashboard/#pr-1087][#1087]]: 1086 Editorial changes to array:values
+ PR [[https://qt4cg.org/dashboard/#pr-1078][#1078]]: 1060-partial Formatting XPath/XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-1077][#1077]]: Correct the status of new language features
+ PR [[https://qt4cg.org/dashboard/#pr-1076][#1076]]: 1075 Drop 'with' expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1074][#1074]]: Confirm status of provisional functions
+ PR [[https://qt4cg.org/dashboard/#pr-1071][#1071]]: 1070 Bare Brace map constructor syntax
+ PR [[https://qt4cg.org/dashboard/#pr-1068][#1068]]: 73 fn:graphemes
+ PR [[https://qt4cg.org/dashboard/#pr-1066][#1066]]: 1052 Simplify the results of parse-csv
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis - revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1059][#1059]]: 1019 XQFO: Unknown option parameters
+ PR [[https://qt4cg.org/dashboard/#pr-1027][#1027]]: 150 fn:ranks

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/934][#934]]: String comparison in deep-equal
+ Issue [[https://github.com/qt4cg/qtspecs/issues/910][#910]]: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/908][#908]]: Function identity: documentation still too vague
+ Issue [[https://github.com/qt4cg/qtspecs/issues/882][#882]]: fn:chain or fn:compose
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/557][#557]]: fn:unparsed-binary: accessing and manipulating binary types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: JSON Parsing & Serialization: Numbers
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

This agenda is the unfinished items from last week with “1077” slotted into the
middle. If we get through all of these in less than an hour, we’ll look for some
easy things.

** Brief demo
:PROPERTIES:
:CUSTOM_ID: demo
:END:

SF has offered to give us a brief demo of the work he’s been doing on templates
and web components.

** PR #1066: 1052 Simplify the results of parse-csv
:PROPERTIES:
:CUSTOM_ID: pr-1066
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1066][#1066]]

** PR #1059: 1019 XQFO: Unknown option parameters
:PROPERTIES:
:CUSTOM_ID: pr-1059
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1059][#1059]]

** PR #1077: Correct the status of new language features
:PROPERTIES:
:CUSTOM_ID: pr-1077
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1077][#1077]]

** PR #1068: 73 fn:graphemes
:PROPERTIES:
:CUSTOM_ID: pr-1068
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1068][#1068]]

** PR #832: 77 Add map:deep-update and array:deep-update
:PROPERTIES:
:CUSTOM_ID: pr-832
:END:

See PR [[https://qt4cg.org/dashboard/#pr-832][#832]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
