meeting/agenda/2024/03-19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 070 Agenda 2024-03-19</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 070 Agenda 2024-03-19</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT, 09:00PDT).
</p>

<p>
Reminder: The QT4CG meeting is scheduled on UK/European civil time. The United
States has switched to daylight saving time, so the meeting will be one hour
later there until the UK/Europe also switches (on 31 March 2024).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/03-12.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 19 March. The following meeting is
scheduled for 26 March.
</p>

<p>
Any regrets for 26 March 2024?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/6]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”
<ul class="org-ul">
<li>Proposed: next Tuesday at 15:00GMT (16:00CET, 11:00EDT)</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-04: NW to try to add test review to the editorial meeting.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.</li>
<li class="on"><code>[X]</code> QT4CG-069-01: MK to list the remaining issues that need discussion.</li>
<li class="trans"><code>[-]</code> QT4CG-069-02: NW to coordinate with MK to use the introspection features on the test suite.
<ul class="org-ul">
<li>In progress…</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-956">#956</a>: 850-partial Editorial improvements to parse-html()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1090">#1090</a>: 1089 Add rounding rules for casting string to duration etc</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1083">#1083</a>: 1079 Change book used in example</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1081">#1081</a>: 1050 Fix ItemType grammar ambiguity</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1080">#1080</a>: 1036 Rephrase the rules for number-parser with liberal JSON</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1073">#1073</a>: XQFO (editorial)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1072">#1072</a>: 883 Return type of load-xquery-module</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/757">#757</a>: Function families</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/463">#463</a>: fn:parts() - extract the parts of a (not-really) atomic value</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/448">#448</a>: Support extended dateTime formats of ISO-8601:2019?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/283">#283</a>: Enumeration types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/218">#218</a>: Function library for maps with composite keys: and thoughts on encapsulation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/119">#119</a>: Allow a map's key value to be any sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/33">#33</a>: JSON Parsing &amp; Serialization: Numbers</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1083">#1083</a>: 1079 Change book used in example</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1093">#1093</a>: 1091 Add fn:collation function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1092">#1092</a>: 1039 Add notes referring to fn:collation-key</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1087">#1087</a>: 1086 Editorial changes to array:values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1078">#1078</a>: 1060-partial Formatting XPath/XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1077">#1077</a>: Correct the status of new language features</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1076">#1076</a>: 1075 Drop 'with' expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1074">#1074</a>: Confirm status of provisional functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1071">#1071</a>: 1070 Bare Brace map constructor syntax</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>: 73 fn:graphemes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1066">#1066</a>: 1052 Simplify the results of parse-csv</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1059">#1059</a>: 1019 XQFO: Unknown option parameters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>: 150 fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.6.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/934">#934</a>: String comparison in deep-equal</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation still too vague</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/882">#882</a>: fn:chain or fn:compose</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/583">#583</a>: array:replace(), etc</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/33">#33</a>: JSON Parsing &amp; Serialization: Numbers</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
This agenda is the unfinished items from last week with “1077” slotted into the
middle. If we get through all of these in less than an hour, we’ll look for some
easy things.
</p>
</div>

<div id="outline-container-demo" class="outline-3">
<h3 id="demo"><span class="section-number-3">2.1.</span> Brief demo</h3>
<div class="outline-text-3" id="text-demo">
<p>
SF has offered to give us a brief demo of the work he’s been doing on templates
and web components.
</p>
</div>
</div>

<div id="outline-container-pr-1066" class="outline-3">
<h3 id="pr-1066"><span class="section-number-3">2.2.</span> PR #1066: 1052 Simplify the results of parse-csv</h3>
<div class="outline-text-3" id="text-pr-1066">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1066">#1066</a>
</p>
</div>
</div>

<div id="outline-container-pr-1059" class="outline-3">
<h3 id="pr-1059"><span class="section-number-3">2.3.</span> PR #1059: 1019 XQFO: Unknown option parameters</h3>
<div class="outline-text-3" id="text-pr-1059">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1059">#1059</a>
</p>
</div>
</div>

<div id="outline-container-pr-1077" class="outline-3">
<h3 id="pr-1077"><span class="section-number-3">2.4.</span> PR #1077: Correct the status of new language features</h3>
<div class="outline-text-3" id="text-pr-1077">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1077">#1077</a>
</p>
</div>
</div>

<div id="outline-container-pr-1068" class="outline-3">
<h3 id="pr-1068"><span class="section-number-3">2.5.</span> PR #1068: 73 fn:graphemes</h3>
<div class="outline-text-3" id="text-pr-1068">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>
</p>
</div>
</div>

<div id="outline-container-pr-832" class="outline-3">
<h3 id="pr-832"><span class="section-number-3">2.6.</span> PR #832: 77 Add map:deep-update and array:deep-update</h3>
<div class="outline-text-3" id="text-pr-832">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
